src/cf/Catalogs/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Склады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Склады/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

// обработка события получения данных выбора
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.СтрокаПоиска = Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		
		//Сфорируем список с предупреждениями
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Склады.Ссылка,
			|	Склады.Наименование,
			|	Склады.НеИспользовать
			|ИЗ
			|	Справочник.Склады КАК Склады";

		Результат = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Структура = Новый Структура("Значение",  ВыборкаДетальныеЗаписи.Ссылка);
			
			//Заполним предупреждение
			Если ВыборкаДетальныеЗаписи.НеИспользовать Тогда
				ТекстПредупреждения = НСтр("ru='Этот склад не должен использоваться!", "ru");
				Структура.Вставить("Предупреждение", ТекстПредупреждения);
			КонецЕсли;
			
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение = Структура;
			Элемент.Представление = ВыборкаДетальныеЗаписи.Наименование;
			
		КонецЦикла;
		
	Иначе
		
		//Исключим неиспользуемые из ввода по строке
		Параметры.Отбор.Вставить("НеИспользовать", Ложь);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПервоначальноеЗаполнение() Экспорт
	
	// Заполнение основного склада
	СкладОбъект = Основной.ПолучитьОбъект();
	СкладОбъект.Собственный = Истина;
	СкладОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти
